Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: _Solution_: You can inject the `CustomScopeAnnotationsBuildItem` in a build step and use the convenient methods such as `CustomScopeAnnotationsBuildItem.isScopeDeclaredOn()`.
ja_jp: _ソリューション_: ビルドステップで `CustomScopeAnnotationsBuildItem` を挿入し、 `CustomScopeAnnotationsBuildItem.isScopeDeclaredOn()` などの便利なメソッドを使用できます。

source: _TL;DR : On Windows, Linux, or MacOS, (x86_64 or ARM64 architecture), you won't need to provide a JRE to run the Quarkus tooling in VS Code._
ja_jp: _TL;DR : Windows、Linux、またはMacOS（x86_64またはARM64アーキテクチャ）では、VS CodeでQuarkusツールを実行するためにJREを提供する必要はありません。_

source: _Template inheritance_ makes it possible to reuse template layouts.
ja_jp: _テンプレートの継承_ により、テンプレートレイアウトの再利用が可能になります。

source: _This demonstrates the power of WebAssembly: we can use the mature, battle-tested Google CEL-Go library from Java without reimplementing CEL from scratch._
ja_jp: _これは WebAssembly のパワーを示しています。成熟し、十分にテストされた Google CEL-Go ライブラリーを、CEL を一から再実装することなく Java から使用できるのです。_

source: _Value present_
ja_jp: _現在の値_

source: __How are these metrics consumed?__ As said, Micrometer exposes the metrics on the `/q/metrics` endpoint in order to be consumed by third parties like https://prometheus.io/[Prometheus]. OpenShift provides an embedded Prometheus instance that we can use. So, let's see what we need to do to integrate our Quarkus Applications metrics and the Prometheus embedded instance provided in OpenShift.
ja_jp: __これらのメトリクスはどのように消費されるのですか？__ 前述の通り、Micrometer は link:https://prometheus.io/[Prometheus] のようなサードパーティが利用できるように `/q/metrics` エンドポイントでメトリクスを公開しています。OpenShiftにはPrometheusのインスタンスが埋め込まれているので、それを利用することができます。それでは、Quarkus Applicationsのメトリクスと、OpenShiftで提供されているPrometheusの埋め込みインスタンスを統合するために必要なことを見ていきましょう。

source: __On the JVM, if the generated class needs to have a parameterless constructor, default values for all properties have to be specified (see Constructors).__
ja_jp: _JVMでは、生成されたクラスがパラメータレス・コンストラクタを持つ必要がある場合、すべてのプロパティのデフォルト値を指定する必要があります（「コンストラクタ」を参照）。_

source: _always_ - check for the updates on every catalog request;
ja_jp: _always_- カタログ要求のたびに更新情報を確認する。

source: _bare_ verticle - Java classes extending `io.vertx.core.AbstractVerticle`
ja_jp: _生の_ verticle - `io.vertx.core.AbstractVerticle` を拡張するJavaクラス

source: _classic_ - always on a worker thread,
ja_jp: _classic_- 常にワーカースレッドで動作します。

source: _daily_ (default) - check for the catalog updates once a day on the first catalog request;
ja_jp: _daily_（デフォルト） - 1日1回、最初のカタログ要求時に、カタログの更新をチェック。

source: _deprecated_ - During the readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Deprecated: Use 'health-topic-verification-timeout' instead. Type: _long_
ja_jp: _deprecated_ - レディネスヘルスチェック中に、コネクターはブローカーに接続し、トピックのリストを取得します。この属性は、取得の最大期間 (ミリ秒単位) を指定します。超過した場合、チャネルは準備ができていないと見なされます。非推奨: 代わりに health-topic-verification-timeout を使用します。 Type: _long_

source: _deprecated_ - Whether the readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin connection. Deprecated: Use 'health-topic-verification-enabled' instead. Type: _boolean_
ja_jp: _deprecated_ - レディネスチェックでトピックがブローカーに存在することを確認する必要があるかどうか。デフォルトは false です。有効にするには、管理者接続が必要です。非推奨: 代わりに health-topic-verification-enabled を使用します。 Type: _boolean_

source: _interceptor bindings_: on the class and on the methods
ja_jp: _インターセプターバインディング_: クラスとメソッド

source: _interval:X_ (where X is an integer in minutes) - custom interval in minutes;
ja_jp: _interval:X_ (Xは整数、分単位) - 分単位のカスタム間隔。

source: _never_ - resolve the catalogs once and never check for updates.
ja_jp: _never_ - カタログを一度解決すると、更新をチェックしない。

source: _reactive_ - on the I/O thread or on a worker thread (and you, as the developer, have the choice)
ja_jp: _reactive_ - I/Oスレッドまたはワーカースレッド（そして開発者であるあなたが選択可能）

source: _stereotypes_: on the class
ja_jp: _ステレオタイプ_: クラスについて

source: _“Developers new to Quarkus often wonder why there are so few questions on Stack Overflow. This is because the main discussion between users and the Quarkus team happens on https://quarkusio.zulipchat.com/[Zulip]. Go there and you will quickly get answers to your questions, often by the Quarkus team directly.” - Bernhard Lutzmann_
ja_jp: _"Quarkusを初めて使う開発者は、Stack Overflowに質問が少ないことを不思議に思うことがよくあります。これは、ユーザーとQuarkusチームの間の主な議論が https://quarkusio.zulipchat.com/[Zulip] で行われているからです。そこに行けば、質問に対する回答がすぐに得られ、多くはQuarkusチームが直接回答しています。"- Bernhard Lutzmann_

source: _“When considering Quarkus’ native capability, make sure the libraries that you use are native compatible. The best approach is to stay with the core Quarkus extensions for as long as possible.” - Bernhard Lutzmann, Polaris project architect and backend software engineer_
ja_jp: _"Quarkusのネイティブ機能を検討する際には、使用するライブラリがネイティブに対応しているかどうかを確認してください。最良のアプローチは、できるだけ長くコアのQuarkusエクステンションを使い続けることです。"- Polarisプロジェクトアーキテクト兼バックエンドソフトウェアエンジニア、Bernhard Lutzmann氏_

source: `!Unstable*`: all classes except classes starting with `Unstable`
ja_jp: `!Unstable*` : `Unstable` で始まるクラスを除くすべてのクラス。

source: `!` will be the default value if `greeting.suffix` is not set.
ja_jp: `!` は、 `greeting.suffix` が設定されていない場合のデフォルト値になります。

source: `"<classname>"` for per class configuration
ja_jp: `"<classname>"`: クラスごとの設定

source: `"<classname>/<methodname>"` for per method configuration
ja_jp: `"<classname>/<methodname>"`: メソッドごとの設定

source: `#fast*+slowTest`: all classes, and in them, only methods starting with `fast` or methods named `slowTest`
ja_jp: `#fast*+slowTest`: すべてのクラスの中で `fast` で始まるメソッドまたは `slowTest` という名前のメソッドのみ

source: `#if` Section Example
ja_jp: `#if`セクションの例

source: `#let` Optional End Tag Example
ja_jp: `#let` オプションの終了タグの例

source: `$1`, `$2`, etc.
ja_jp: `$1`, `$2` など

source: `$NAME-keystore.p12`: Contains the private key and the certificate. It is password-protected.
ja_jp: `$NAME-keystore.p12`: 秘密鍵と証明書が含まれます。 パスワードで保護されています。

source: `$NAME-truststore.p12`: Contains the CA certificate, which you can use as a truststore, for example, for testing.
ja_jp: $NAME-truststore.p12`: テスト用などにトラストストアとして使用できる CA 証明書が含まれています。

source: `${expression:value}` - Provides a default value after the `:` if the expansion doesn't find a value.
ja_jp: `${expression:value}` - 拡張で値が見つからない場合、 `:` の後にデフォルト値を提供します。

source: `${my.prop${compose}}` - Composed expressions. Inner expressions are resolved first.
ja_jp: `${my.prop${compose}}` - 構成された式。内部式が最初に解決されます。

source: `${my.prop}${my.prop}` - Multiple expressions.
ja_jp: `${my.prop}${my.prop}` - 複数の式。

source: `%dev.quarkus.flyway.clean-at-start` and `%test.quarkus.flyway.clean-at-start` will be set, to clean the DB after reload in dev/test mode
ja_jp: `%dev.quarkus.flyway.clean-at-start` と `%test.quarkus.flyway.clean-at-start` が設定され、開発/テストモードでリロードした後に DB をクリーンアップします。

source: `%dev.quarkus.flyway.clean-at-start` and ``%test.quarkus.flyway.clean-at-start` will be set, to clean the DB after reload in dev/test mode
ja_jp: `%dev.quarkus.flyway.clean-at-start` と ``%test.quarkus.flyway.clean-at-start` が設定され、dev/testモードでリロードした後にDBをクリーンアップします。

source: `%prod.quarkus.oidc.auth-server-url` sets the base URL of the OpenID Connect (OIDC) server. The `%prod.` profile prefix ensures that `Dev Services for Keycloak` launches a container when you run the application in development (dev) mode. For more information, see the <<bearer-token-tutorial-keycloak-dev-mode>> section.
ja_jp: `%prod.quarkus.oidc.auth-server-url` は、OpenID Connect (OIDC) サーバーのベース URL を設定します。 `%prod.` プロファイル接頭辞により、アプリケーションを開発 (dev) モードで実行する際に、`Dev Services for Keycloak` がコンテナーを起動するようになります。 詳細は、<<bearer-token-tutorial-keycloak-dev-mode>> セクションを参照してください。

source: `*Test#test*One+testTwo?????`: all classes ending with `Test`, and in them, only methods starting with `test` and ending with `One`, or starting with `testTwo` and followed by 5 arbitrary characters
ja_jp: `*Test#test*One+testTwo?????`: `Test` で終わるすべてのクラスで、その中の `test` で始まり `One` で終わるメソッド、または `testTwo` で始まり 5 文字の任意の文字が続くメソッドのみ

source: `*` `redirect_uri` value is set by `Dev Services for Keycloak` when it creates a default realm, if no custom realm is imported.
ja_jp: カスタムレルムがインポートされていない場合、 `*` `redirect_uri` の値はデフォルトのレルムを作成するときに `Dev Services for Keycloak` によって設定されます。

source: `+`: Concatenation
ja_jp: `+`: 連結

source: `+`: Infix notation for concatenation, works with `String` and `StringBuilder` base objects
ja_jp: `+`: 連結のための中置記法。`String` および `StringBuilder` 基本オブジェクトで動作します。

source: `--concise` Display the name (artifactId) and description
ja_jp: `--concise` 名前（artifactId）と説明を表示します

source: `--data` contains the GCS event, it is a JSON document with the name of the file added to the bucket.
ja_jp: `--data` には GCS イベントを指定します。これは、バケットに追加されたファイル名を含む JSON形式のフォーマットです。

source: `--full` Display concise format and version/status-related columns.
ja_jp: `--full` concise フォーマットに加えバージョン/ステータス関連のカラムを表示

source: `--install` installs the CA in the system truststore. Windows, Mac, and Linux (Fedora and Ubuntu) are supported. However, depending on your browser, you might need to import the generated CA manually. Refer to your browser's documentation for more information. The generated CA is located in `$HOME/.quarkus/quarkus-dev-root-ca.pem`.
ja_jp: `--install` は、システムトラストストアに CA をインストールします。 Windows、Mac、Linux (Fedora および Ubuntu) がサポートされています。 ただし、ブラウザーによっては、生成された CA を手動でインポートすることを推奨します。 詳細は、ブラウザーのドキュメントを参照してください。 生成された CA は `$HOME/.quarkus/quarkus-dev-root-ca.pem` に配置されます。

source: `--java=17` for the CLI
ja_jp: CLIの場合 `--java=17`

source: `--name` Display the name (artifactId) only
ja_jp: `--name` 名前 (artifactId) のみの表示

source: `--origins` Display concise information along with the Quarkus platform release origin of the extension.
ja_jp: `--origins` conciseフォーマットと共に、エクステンションのQuarkusプラットフォームリリースオリジンを表示します。

source: `--renew` renews the CA if it already exists. When this option is used, the private key is changed, so you need to regenerate the certificates signed by the CA. If the CA expires, it will automatically renew without requiring the `--renew` option.
ja_jp: `--renew` は、CA がすでに存在する場合にそれを更新します。 このオプションを使用すると、秘密鍵が変更されます。そのため、CA によって署名された証明書を再生成する必要があります。 CA の有効期限が切れると、`--renew` オプションを必要とせずに自動的に更新されます。

source: `--support-scope` Display support scope associated with each extension (if any) for an offering configured in the registry client configuration.
ja_jp: `--support-scope` レジストリークライアント設定で設定されたオファリングに対して、各エクステンション (もしあれば) に関連付けられたサポートスコープを表示します。

source: `--truststore` also generates a PKCS12 truststore containing the CA certificate.
ja_jp: `--truststore` は、CA 証明書を含む PKCS12 トラストストアも生成します。

source: `-DjavaVersion="17"` for Maven
ja_jp: Mavenの場合 `-DjavaVersion="17"`

source: `-Dquarkus.native.container-build=true` will produce an additional text file named `native-builder.image` holding the docker image name to be used to build the native image.
ja_jp: `-Dquarkus.native.container-build=true` は、ネイティブイメージのビルドに使用するDockerイメージ名を保持する `native-builder.image` という名前の追加のテキストファイルを生成します。

source: `-XX:` Java command line option that should be added to command line launching an application in dev mode
ja_jp: `-XX:` 開発モードでアプリケーションを起動するコマンドラインに追加する必要がある Java コマンドラインオプション

source: `-concept.adoc` for concept documents
ja_jp: 概念関連のドキュメント用の `-concept.adoc`

source: `-howto.adoc` for how-to guides
ja_jp: ハウツーガイド用の `-howto.adoc`

source: `-reference.adoc` for references
ja_jp: リファレンス用の `-reference.adoc`

source: `-tutorial.adoc` for tutorials
ja_jp: チュートリアル用の `-tutorial.adoc`

source: `-tutorial.adoc` will indicate that this document is a tutorial
ja_jp: `-tutorial.adoc` は、このドキュメントがチュートリアルであることを示す

source: `-tutorial` will indicate that this document is a tutorial (optional)
ja_jp: `-tutorial` この文書がチュートリアルであることを示します (オプション)

source: `./[java/kotlin/scala]` contains all the files that will be processed only if the specified language has been selected (overriding base)
ja_jp: `./[java/kotlin/scala]` は、指定された言語が選択されている場合にのみ処理されるすべてのファイルを含みます（baseをオーバーライドします）

source: `./base` contains all the files that will be processed independently of the specified language
ja_jp: `./base` には、指定された言語とは無関係に処理されるすべてのファイルが含まれます

source: `.adoc` to indicate this is an asciidoc file
ja_jp: `.adoc` asciidocファイルであることを示します

source: `.env` file in the current working directory
ja_jp: 現在の作業ディレクトリーにある `.env` ファイル

source: `.jks` files are password-protected, so you need to provide the password to open the keystore. Also, they can include more than one certificate and private key. If this is the case:
ja_jp: `.jks` ファイルはパスワードで保護されているため、キーストアを開くにはパスワードを入力する必要があります。 また、複数の証明書と秘密鍵を含めることもできます。 この場合、次のことが可能です。

source: `.jks` files are password-protected, so you need to provide the password to open the keystore. Also, they can include multiple certificates and private keys. If this is the case:
ja_jp: `.jks` ファイルはパスワードで保護されているため、キーストアを開くにはパスワードを指定する必要があります。また、これらには複数の証明書と秘密鍵を含めることができます。その場合は、次のようになります。

source: `.jks` files are password-protected, so you need to provide the password to open the truststore. However, unlike keystores, the alias does not require a password because it contains a public certificate, not a private key.
ja_jp: `.jks` ファイルはパスワードで保護されているため、トラストストアを開くにはパスワードを入力する必要があります。 ただし、キーストアとは異なり、トラストストアには秘密鍵ではなく公開証明書が含まれているため、エイリアスにパスワードは必要ありません。

source: `.jks`, `.keystore`, and `.truststore` are read as JKS keystores and truststores.
ja_jp: `.jks`、 `.keystore`、および `.truststore` は、JKS キーストアおよびトラストストアとして読み取られます。

source: `.p12` files are password-protected, so you need to provide the password to open the keystore.
ja_jp: `.p12` ファイルはパスワードで保護されているため、キーストアを開くにはパスワードを指定する必要があります。

source: `.p12` files are password-protected, so you need to provide the password to open the truststore. However, unlike keystores, the alias does not require a password because it contains a public certificate, not a private key.
ja_jp: `.p12` ファイルはパスワードで保護されているため、トラストストアを開くにはパスワードを入力する必要があります。 ただし、キーストアとは異なり、トラストストアには秘密鍵ではなく公開証明書が含まれているため、エイリアスにパスワードは必要ありません。

source: `.p12`, `.pkcs12`, and `.pfx` are read as PKCS12 keystores and truststores.
ja_jp: `.p12`、 `.pkcs12`、および `.pfx` は、PKCS12 キーストアおよびトラストストアとして読み取られます。

source: `.pem`, `.crt`, and `.key` are read as PEM certificates and keys.
ja_jp: `.pem`、 `.crt`、および `.key` は PEM 証明書および鍵として読み取られます。

source: `.tpl.qute` will be processed with Qute and can use data (`.tpl.qute` will be removed from the output file name).
ja_jp: `.tpl.qute` は、Quteで処理され、データを使用することができます（出力ファイル名から `.tpl.qute` が削除されます）。

source: `.withTransaction()` will automatically flush at commit
ja_jp: `.withTransaction()` はコミット時に自動的にフラッシュされます。

source: `/home/jboss` is the WORKDIR for all quarkus binaries in the base images `ubi8/openjdk-11-runtime` and `ubi8/openjdk-17-runtime` (https://catalog.redhat.com/software/containers/ubi8/openjdk-17/618bdbf34ae3739687568813?container-tabs=dockerfile[Dockerfile for ubi8/openjdk-17-runtime, window="_blank"])
ja_jp: `/home/jboss` は、ベースイメージ `ubi8/openjdk-11-runtime` および `ubi8/openjdk-17-runtime` 内のすべての Quarkus バイナリの WORKDIR です( link:https://catalog.redhat.com/software/containers/ubi8/openjdk-17/618bdbf34ae3739687568813?container-tabs=dockerfile[ubi8/openjdk-17-runtime 用の Dockerfile, target="_blank"] ）。

source: `/home/jboss` is the WORKDIR for all quarkus binaries in the base images `ubi8/openjdk-11-runtime`, `ubi8/openjdk-17-runtime` and `ubi8/openjdk-21-runtime` (https://catalog.redhat.com/software/containers/ubi8/openjdk-17/618bdbf34ae3739687568813?container-tabs=dockerfile[Dockerfile for ubi8/openjdk-17-runtime, window="_blank"])
ja_jp: `/home/jboss` は、ベースイメージ `ubi8/openjdk-11-runtime`, `ubi8/openjdk-17-runtime`, `ubi8/openjdk-21-runtime` ( link:https://catalog.redhat.com/software/containers/ubi8/openjdk-17/618bdbf34ae3739687568813?container-tabs=dockerfile[ubi8/openjdk-17-runtime 用の Dockerfile] ) にある Quarkus バイナリすべての WORKDIR です。

source: `/home/jboss` is the WORKDIR for all quarkus binaries in the base images `ubi9/openjdk-17-runtime` and `ubi9/openjdk-21-runtime` (https://catalog.redhat.com/software/containers/ubi9/openjdk-21-runtime/6501ce769a0d86945c422d5f?container-tabs=dockerfile[Dockerfile for ubi9/openjdk-17-runtime, window="_blank"])
ja_jp: `/home/jboss` は、ベースイメージ `ubi9/openjdk-17-runtime` および `ubi9/openjdk-21-runtime` 内のすべての quarkus バイナリの WORKDIR です (https://catalog.redhat.com/software/containers/ubi9/openjdk-21-runtime/6501ce769a0d86945c422d5f?container-tabs=dockerfile[ubi9/openjdk-17-runtime の Dockerfile、window="_blank"])

source: `/https://([a-z0-9\\-_]+)\\.app\\.mydomain\\.com/` is treated as a regular expression because it is surrounded by forward slash characters.
ja_jp: `/https://([a-z0-9\\-_]+)\\.app\\.mydomain\\.com/` は、フォワードスラッシュ文字で囲まれているため、正規表現として扱われます。

source: `/https://([a-z0-9\\-_]+)\\\\.app\\\\.mydomain\\\\.com/` is treated as a regular expression because forward slash characters surround it.
ja_jp: `/https://([a-z0-9\\-_]+)\\\\.app\\\\.mydomain\\\\.com/` はスラッシュで囲まれているため、正規表現として扱われます。

source: `/index.html` and `/web-app/service`
ja_jp: `/index.html` と `/web-app/service`

source: `/q/health/live` - The application is up and running.
ja_jp: `/q/health/live` - アプリケーションが稼働していること

source: `/q/health/ready` - The application is ready to serve requests.
ja_jp: `/q/health/ready` - アプリケーションは、リクエストに対応する準備ができていること

source: `/q/health/started` - The application is started.
ja_jp: `/q/health/started` - アプリケーションが開始されていること

source: `/q/health` - Accumulating all health check procedures in the application.
ja_jp: `/q/health` - アプリケーションのすべてのヘルスチェック手順の累積

source: `/vertx/book` returns the content from a large file (a book)
ja_jp: `/vertx/book` 大きなファイル（本）からコンテンツを返す

source: `/vertx/hello` uses the Vert.x event bus to produce the response
ja_jp: `/vertx/hello` は、Vert.x イベントバスを使用してレスポンスを生成します

source: `/vertx/lorem` returns the content from a small file
ja_jp: `/vertx/lorem` 小さなファイルからコンテンツを返す

source: `/vertx/web` uses the Vert.x Web Client to retrieve data from Wikipedia
ja_jp: `/vertx/web` は、Vert.x Web クライアントを使用して Wikipedia からデータを取得します

source: `/web-app/service1` and `/web-app/service2`
ja_jp: `/web-app/service1` と `/web-app/service2`

source: `/web-app1/service` and `/web-app2/service`
ja_jp: `/web-app1/service` と `/web-app2/service`

source: `0` will result in the use of a random port (assigned by the operating system).
ja_jp: `0` を使用すると、(オペレーティングシステムによって割り当てられた)ランダムなポートが使用されることになります。

source: `10`: best compression (can be slow for big files)
ja_jp: `10`: 最高の圧縮率（大きなファイルでは遅い場合があります。）

source: `1`: faster compression
ja_jp: `1`: より速い圧縮

source: `2-2-2022` would have been a perfect day to release a 2.2.2.Final version of Quarkus but we didn't get that lucky. Today we announce the release of *Quarkus 2.7.0.Final*.
ja_jp: `2022/2/2` は、Quarkusの2.2.2.Finalバージョンをリリースするのに最適な日だったのですが、そのような幸運には恵まれませんでした。本日、Quarkus *2.7.0.Final* のリリースを発表します。

source: `8080` is the localhost HTTP port your application is listening on. Note that the application will be accessible from `http://YOUR-NGROK-DOMAIN` on port `80` but redirected to your local machine on port `8080`.
ja_jp: `8080` は、アプリケーションがリッスンしているローカルホストの HTTP ポートです。 アプリケーションは、ポート `80` の `http://YOUR-NGROK-DOMAIN` からアクセスできますが、ポート `8080` のローカルマシンにリダイレクトされることに注意してください。

source: `9`: better compression
ja_jp: `9`: より高い圧縮率

source: `:` character in the property keys must be escaped.
ja_jp: プロパティキーに含まれる`:` は、エスケープする必要があります。

source: `:summary: <text>`
ja_jp: 概要

source: `<alias?>` - the alias of an iterated element suffixed with a question mark is used
ja_jp: `<alias?>` - クエスチョンマークを接尾辞とする反復処理された要素のエイリアスを使用します。

source: `<alias_>` - the alias of an iterated element suffixed with an underscore is used (default)
ja_jp: `<alias_>` - アンダースコアを接尾辞とする反復子要素のエイリアスを使用します (デフォルト)

source: `<br>` is only rendered if the iteration has more elements.
ja_jp: `<br>` は、反復処理がより多くの要素を持っている場合にのみレンダリングされます。

source: `<empty>`
ja_jp: `<空>`

source: `<executable-name>` is the base file name (without the extension) of the executable that launches an application;
ja_jp: この場合の `<executable-name>` は、アプリケーションを起動する実行可能ファイルの基本ファイル名 (拡張子なし) です。

source: `<format>` is either `json` (the default) or `xml`, which can be configured using `quarkus.cyclonedx.format` property. If both formats are desired `quarkus.cyclonedx.format` can be set to `all`.
ja_jp: `<format>` は `json` (デフォルト) または `xml` のいずれかで、 `quarkus.cyclonedx.format` プロパティーを使用して設定できます。両方の形式が必要な場合は、 `quarkus.cyclonedx.format` を `all` に設定します。

source: `<none>` - no prefix is used
ja_jp: `<none>` - 接頭辞は使用しません。

source: `<query>` will expand to `delete from EntityName where <query>`
ja_jp: `<query>` は `delete from EntityName where <query>` に展開されます

source: `<query>` will expand to `from EntityName where <query>`
ja_jp: `<query>` は `from EntityName where <query>` に展開されます

source: `<query>` will expand to `{<query>}` where we will map the PanacheQL query to MongoDB native query form. We support the following operators that will be mapped to the corresponding MongoDB operators: 'and', 'or' ( mixing 'and' and 'or' is not currently supported), '=', '>', '>=', '<', '<=', '!=', 'is null', 'is not null', and 'like' that is mapped to the MongoDB `$regex` operator (both String and JavaScript patterns are supported).
ja_jp: `<query>` は `{<query>}` に展開され、PanacheQL のクエリを MongoDB のネイティブクエリ形式にマッピングします。以下の演算子をサポートしており、対応するMongoDBの演算子にマッピングされます。'and', 'or' ('and' と 'or' の混合は現在サポートされていません)、 '=', '&gt;', '&gt;=', '&lt;', '&lt;=', '!=', 'is null', 'is not null', そして MongoDB `$regex` 演算子にマッピングされる 'like' (String と JavaScript の両方のパターンをサポートしています)。

source: `<qui-assistant-button>`: A pre-styled pink button with a robot icon.
ja_jp: `<qui-assistant-button>`: ロボットアイコンが付いた、スタイル済みのピンク色のボタン。

source: `<qui-assistant-chat>`: A button that deep-link to the chat screen with the current chat.`
ja_jp: `<qui-assistant-chat>`: 現在のチャット画面へディープリンクするボタン。

source: `<qui-assistant-warning>`: A standard warning message with the text: `"Quarkus assistant can make mistakes. Check responses."`
ja_jp: `<qui-assistant-warning>`: `"Quarkus assistant can make mistakes. Check responses."` というテキストを含む標準的な警告メッセージ。

source: `<singleAttribute>` (and single parameter) which will expand to `delete from EntityName where <singleAttribute> = ?`
ja_jp: `<singleAttribute>` (および単一のパラメータ) は、 `delete from EntityName where <singleAttribute> = ?` に展開されます。

source: `<singleAttribute>` (and single parameter) which will expand to `from EntityName where <singleAttribute> = ?`
ja_jp: `<singleAttribute>` (および単一のパラメータ) は、 `from EntityName where <singleAttribute> = ?` に展開されます。

source: `<singleColumnName>` (and single parameter) which will expand to `delete from EntityName where <singleColumnName> = ?`
ja_jp: `<singleColumnName>` （およびシングルパラメータ）は `delete from EntityName where <singleColumnName> = ?` に展開されます

source: `<singleColumnName>` (and single parameter) which will expand to `from EntityName where <singleColumnName> = ?`
ja_jp: `<singleColumnName>` （およびシングルパラメータ は `from EntityName where <singleColumnName> = ?` に展開されます

source: `<singlePropertyName>` (and single parameter) which will expand to `{'singleColumnName': '?1'}`
ja_jp: <singlePropertyName>` (そしてシングルパラメーター) で、 `{'singleColumnName': '?1'}` に展開されます。

source: `<singlePropertyName>` (and single parameter) which will expand to the update document `{'$set' : {'singleColumnName': '?1'}}`
ja_jp: <singlePropertyName>` (そしてシングルパラメーター) で、更新ドキュメント `{'$set' : {'singleColumnName': '?1'}` に展開されます。

source: `<suppress until="2022-01-01Z">...</suppress>` You can adjust the expiry date if you need to.
ja_jp: `<suppress until="2022-01-01Z">…​</suppress>` 必要であれば有効期限を調整することもできます。

source: `???Test`: all classes named with 3 arbitrary characters followed by `Test`
ja_jp: `???Test` : 任意の3文字の後に `Test`
